books/Prooftheory.org
#+TITLE: Proof Theory
#+AUTHOR: Gaisi Takeuti

#+EXPORT_FILE_NAME: ../latex/ProofTheory/ProofTheory.tex
#+LATEX_HEADER: \input{preamble.tex}
#+LATEX_HEADER: \usepackage{ebproof}
#+LATEX_HEADER: \def \LJ {\textbf{LJ}}
#+LATEX_HEADER: \def \LK {\textbf{LK}}
#+LATEX_HEADER: \def \LKsh {\textbf{LK\#}}
#+LATEX_HEADER: \def \LKs {\textbf{LK}^*}
* First Order Predicate Calculus
  In this chapter we shall present Gentzen's formulation of the first order predicate
  calculus \(\LK\) (logistischer klassischer Kalkül). Intuitionisitic logic is known as \(\LJ\)
  (logistischer intuitionistischer Kalkül) 
** Formalization of statements
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   *Formulas* are defined inductively as:
   3. [@3] If \(A\) is a formula, \(a\) is a free variable and \(x\) is a bound
      variable not occurring in \(A\), then \(\forall xA'\) and \(\exists xA'\) are
      formulas, where \(A'\) is the expression obtained from \(A\) by writing
      \(x\) in place of \(a\) at each occurrence of \(a\) in \(A\)
   #+END_definition

   
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   Let \(A\) be an expression, let \(\tau_1,\dots,\tau_n\) be distinct primitive
   symbols, and let \(\sigma_1,\dots,\sigma_n\) be any symbols. By
   \begin{equation*}
   \left(
   A\frac{\tau_1,\dots,\tau_n}{\sigma_1,\dots,\sigma_n}
   \right)
   \end{equation*}
   we mean the expression obtained from \(A\) by writing
   \(\sigma_1,\dots,\sigma_n\) in place of \(\tau_1,\dots,\tau_n\) respectively
   at each occurrence of \(\tau_1,\dots,\tau_n\). Such an operation is called
   the *(simultaneous) replacement of* \((\tau_1,\dots,\tau_n)\) *by*
   \((\sigma_1,\dots,\sigma_n)\) *in* \(A\).
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_proposition
   1. If \(A\) contains none of \(\tau_1,\dots,\tau_n\), then
      \begin{equation*}
      \left(
      A\frac{\tau_1,\dots,\tau_n}{\sigma_1,\dots,\sigma_n}
      \right)
      \end{equation*}
      is \(A\) itself
   2. If \(\sigma_1,\dots,\sigma_n\) are distinct primitive symbols, then
      \begin{equation*}
      \left(\left(
      A\frac{\tau_1,\dots,\tau_n}{\sigma_1,\dots,\sigma_n}
      \right)\frac{\sigma_1,\dots,\sigma_n}{\theta_1,\dots,\theta_n}\right)
      \end{equation*}
      is identical with
      \begin{equation*}
      \left(
      A\frac{\tau_1,\dots,\tau_n}{\theta_1,\dots,\theta_n}
      \right)
      \end{equation*}
   #+END_proposition

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   1. Let \(A\) be a formula and \(t_1,\dots,t_n\) be terms. If there is a
      formula \(B\) and \(n\) distinct free variables \(b_1,\dots,b_n\) s.t.
      \(A\) is
      \begin{equation*}
      \left(
      B\frac{b_1,\dots,b_n}{t_1,\dots,t_n}
      \right)
      \end{equation*}
      then for each \(i(1\le i\le n)\) the occurrences of \(t_1\) resulting from
      the above replacement are said to be *indicated* in \(A\), and this fact is
      also expressed by writing \(B\) as \(B(b_1,\dots,b_n)\) and \(A\) as \(B(t_1,\dots,t_n)\)
   2. A term \(t\) is *fully indicated* in \(A\), or every occurrence of \(t\) in
      \(A\) is indicated, if every occurrence of \(t\) is obtained by such a replacement
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_proposition
   If \(A\) is a formula (where \(a\) is not necessarily fully indicated) and
   \(x\) is a bound variable not occurring in \(A(a)\), then \(\forall xA(x)\) and
   \(\exists xA(x)\) are formulas
   #+END_proposition

   
