latex/ProofTheory/ProofTheory.tex
% Created 2021-05-28 五 22:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{preamble.tex}
\usepackage{ebproof}
\def \LJ {\textbf{LJ}}
\def \LK {\textbf{LK}}
\def \LKsh {\textbf{LK\#}}
\def \LKs {\textbf{LK}^*}
\author{Gaisi Takeuti}
\date{\today}
\title{Proof Theory}
\hypersetup{
 pdfauthor={Gaisi Takeuti},
 pdftitle={Proof Theory},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{First Order Predicate Calculus}
\label{sec:org3226cbc}
In this chapter we shall present Gentzen's formulation of the first order predicate
calculus \(\LK\) (logistischer klassischer Kalkül). Intuitionisitic logic is known as \(\LJ\)
(logistischer intuitionistischer Kalkül) 
\subsection{Formalization of statements}
\label{sec:org1a8516c}
\begin{definition}[]
\textbf{Formulas} are defined inductively as:
\begin{enumerate}
\setcounter{enumi}{2}
\item If \(A\) is a formula, \(a\) is a free variable and \(x\) is a bound
variable not occurring in \(A\), then \(\forall xA'\) and \(\exists xA'\) are
formulas, where \(A'\) is the expression obtained from \(A\) by writing
\(x\) in place of \(a\) at each occurrence of \(a\) in \(A\)
\end{enumerate}
\end{definition}


\begin{definition}[]
Let \(A\) be an expression, let \(\tau_1,\dots,\tau_n\) be distinct primitive
symbols, and let \(\sigma_1,\dots,\sigma_n\) be any symbols. By
\begin{equation*}
\left(
A\frac{\tau_1,\dots,\tau_n}{\sigma_1,\dots,\sigma_n}
\right)
\end{equation*}
we mean the expression obtained from \(A\) by writing
\(\sigma_1,\dots,\sigma_n\) in place of \(\tau_1,\dots,\tau_n\) respectively
at each occurrence of \(\tau_1,\dots,\tau_n\). Such an operation is called
the \textbf{(simultaneous) replacement of} \((\tau_1,\dots,\tau_n)\) \textbf{by}
\((\sigma_1,\dots,\sigma_n)\) \textbf{in} \(A\).
\end{definition}

\begin{proposition}[]
\begin{enumerate}
\item If \(A\) contains none of \(\tau_1,\dots,\tau_n\), then
\begin{equation*}
\left(
A\frac{\tau_1,\dots,\tau_n}{\sigma_1,\dots,\sigma_n}
\right)
\end{equation*}
is \(A\) itself
\item If \(\sigma_1,\dots,\sigma_n\) are distinct primitive symbols, then
\begin{equation*}
\left(\left(
A\frac{\tau_1,\dots,\tau_n}{\sigma_1,\dots,\sigma_n}
\right)\frac{\sigma_1,\dots,\sigma_n}{\theta_1,\dots,\theta_n}\right)
\end{equation*}
is identical with
\begin{equation*}
\left(
A\frac{\tau_1,\dots,\tau_n}{\theta_1,\dots,\theta_n}
\right)
\end{equation*}
\end{enumerate}
\end{proposition}

\begin{definition}[]
\begin{enumerate}
\item Let \(A\) be a formula and \(t_1,\dots,t_n\) be terms. If there is a
formula \(B\) and \(n\) distinct free variables \(b_1,\dots,b_n\) s.t.
\(A\) is
\begin{equation*}
\left(
B\frac{b_1,\dots,b_n}{t_1,\dots,t_n}
\right)
\end{equation*}
then for each \(i(1\le i\le n)\) the occurrences of \(t_1\) resulting from
the above replacement are said to be \textbf{indicated} in \(A\), and this fact is
also expressed by writing \(B\) as \(B(b_1,\dots,b_n)\) and \(A\) as \(B(t_1,\dots,t_n)\)
\item A term \(t\) is \textbf{fully indicated} in \(A\), or every occurrence of \(t\) in
\(A\) is indicated, if every occurrence of \(t\) is obtained by such a replacement
\end{enumerate}
\end{definition}

\begin{proposition}[]
If \(A\) is a formula (where \(a\) is not necessarily fully indicated) and
\(x\) is a bound variable not occurring in \(A(a)\), then \(\forall xA(x)\) and
\(\exists xA(x)\) are formulas
\end{proposition}
