latex/ProofTheory/ProofTheory.tex


\subsection{Formal proofs and related concepts}
\label{sec:org574f194}
\begin{definition}[]
An \textbf{inference} is an expression of the form

\begin{equation*}
\begin{prooftree}[center=false]
\hypo{S_1}
\infer1{S}
\end{prooftree}\text{ or }
\begin{prooftree}[center=false]
\hypo{S_1}
\hypo{S_2}
\infer2{S}
\end{prooftree}
\end{equation*}
where \(S_1,S_2\) and \(S\) are sequents. \(S_1\) and \(S_2\) are called the
\textbf{upper sequents} and \(S\) is called the \textbf{lower sequent} of the inference
\end{definition}

\begin{definition}[]
For arbitrary \(\Gamma\) and \(\Delta\) in the above notation, \(\Gamma\to\Delta\) is called a
\textbf{sequent}. \(\Gamma\) and \(\Delta\) are called the \textbf{antecedent} and \textbf{succedent},
respectively, of the sequent and each formula in \(\Gamma\) and \(\Delta\) is called a
\textbf{sequent-formula} 
\end{definition}

Structural rules
\begin{enumerate}
\item \textbf{Weakening}:
\begin{equation*}
\text{left: }
\begin{prooftree}
\hypo{\Gamma\to\Delta}
\infer1{D,\Gamma\to\Delta}
\end{prooftree};\quad\text{right: }
\begin{prooftree}
\hypo{\Gamma\to\Delta}
\infer1{\Gamma\to\Delta,D}
\end{prooftree}
\end{equation*}
\(D\) is called the \textbf{weakening formula}
\item \textbf{Contraction}:
\begin{equation*}
\text{left: }
\begin{prooftree}
\hypo{D,D,\Gamma\to\Delta}
\infer1{D,\Gamma\to\Delta}
\end{prooftree}\quad\text{ right: }
\begin{prooftree}
\hypo{\Gamma\to\Delta,D,D}
\infer1{\Gamma\to\Delta,D}
\end{prooftree}
\end{equation*}
\item \textbf{Exchange}
\begin{equation*}
\text{left: }
\begin{prooftree}
\hypo{\Gamma,C,D,\Pi\to\Delta}
\infer1{\Gamma,D,C,\Pi\to\Delta}
\end{prooftree}\quad\text{ right: }
\begin{prooftree}
\hypo{\Gamma\to\Delta,C,D,\Lambda}
\infer1{\Gamma\to\Delta,D,C,\Lambda}
\end{prooftree}
\end{equation*}
\end{enumerate}


We will refer to these three kinds of inferences as "weak inferences",
while all others will be called "strong inferences"
\begin{enumerate}
\setcounter{enumi}{3}
\item \textbf{Cut}
\begin{equation*}
\begin{prooftree}[center=false]
\hypo{\Gamma\to\Delta,D}
\hypo{D,\Pi \to\Lambda}
\infer2{\Gamma,\Pi\to\Delta,\Lambda}
\end{prooftree}
\end{equation*}
\(D\) is called the \textbf{cut formula} of this instance
\end{enumerate}


Logical rules
\begin{enumerate}
\item \begin{equation*}
\neg:\text{left: }
\begin{prooftree}
\hypo{\Gamma\to\Delta,D}
\infer1{\neg D,\Gamma\to\Delta}
\end{prooftree};\quad
\neg:\text{right: }
\begin{prooftree} 
\hypo{D,\Gamma\to\Delta}
\infer1{\Gamma\to\Delta,\neg D}
\end{prooftree}
\end{equation*}
\(D\) and \(\neg D\) are called the \textbf{auxiliary formula} and the \textbf{principal
formula} respectively, of this inference
\item \begin{align*}
&
\begin{prooftree}
\hypo{C,\Gamma\to\Delta}
\infer1[\(\wedge\)left]{C\wedge D,\Gamma\to\Delta}
\end{prooftree}\quad\text{ and }\quad
\begin{prooftree}
\hypo{D,\Gamma\to\Delta}
\infer1[\(\wedge\)left]{C\wedge D,\Gamma\to\Delta}
\end{prooftree}\\
&
\begin{prooftree}[center=false]
\hypo{\Gamma\to\Delta,C}
\hypo{\Gamma\to\Delta,D}
\infer2[\(\wedge\)right]{\Gamma\to\Delta,C\wedge D}
\end{prooftree}
\end{align*}
\(C\) and \(D\) are called the auxiliary formulas and \(C\wedge D\) is
called the principal formula of this inference

\item \begin{align*}
&
\begin{prooftree}[center=false]
\hypo{C,\Gamma\to\Delta}
\hypo{D,\Gamma\to\Delta}
\infer2[\(\vee\)left]{C\vee D,\Gamma\to\Delta}
\end{prooftree}\\&
\begin{prooftree}%[center=false]
\hypo{\Gamma\to\Delta,C}
\infer1[\(\vee\)right]{\Gamma\to\Delta,C\vee D}
\end{prooftree}\quad\text{ and }\quad
\begin{prooftree}%[center=false]
\hypo{\Gamma\to\Delta,D}
\infer1[\(\vee\)right]{\Gamma\to\Delta,C\vee D}
\end{prooftree}
\end{align*}
\(C\) and \(D\) are called the auxiliary formulas and \(C\vee D\) the
principal formula of this inference
\item \begin{equation*}
\begin{prooftree}%[center=false]
\hypo{\Gamma\to\Delta,C}
\hypo{D,\Pi\to \Lambda}
\infer2[\(\supset\)left]{C\supset D,\Gamma,\Pi\to\Delta,\Lambda}
\end{prooftree}\hspace{1cm}
\begin{prooftree}%[center=false]
\hypo{C,\Gamma\to\Delta,D}
\infer1[\(\supset\)right]{\Gamma\to\Delta,C\supset D}
\end{prooftree}
\end{equation*}
\(C\) and \(D\) are called the auxiliary formulas and \(C\supset D\) the
principal formula
\end{enumerate}


1-4 are called \textbf{propositional inferences}
\begin{enumerate}
\setcounter{enumi}{4}
\item \begin{equation*}
\begin{prooftree}%[center=false]
\hypo{F(t),\Gamma\to\Delta}
\infer1[\(\forall\)left]{\forall xF(x),\Gamma\to\Delta}
\end{prooftree}\hspace{1cm}
\begin{prooftree}%[center=false]
\hypo{\Gamma\to\Delta,F(a)}
\infer1[\(\forall\)right]{\Gamma\to\Delta,\forall xF(x)}
\end{prooftree}
\end{equation*}
where \(t\) is an arbitrary term, and \(a\) does not occur in the lower
sequent. \(F(t)\) and \(F(a)\) are called the auxiliary formulas and
\(\forall xF(x)\) the principal formula. The \(a\) in \(\forall\)right is called
the \textbf{eigenvariable} of this inference
\end{enumerate}


In \(\forall\)right all occurrences of \(a\) in \(F(a)\) are indicated. In
\(\forall\)left, \(F(t)\) and \(F(x)\) are
\begin{equation*}
\left(F(a)\frac{a}{t}
\right)\quad\text{ and }\quad
\left(F(a)\frac{a}{t}
\right)
\end{equation*}
respectively, so not every \(t\) in \(F(t)\) is necessarily indicated

\begin{enumerate}
\setcounter{enumi}{5}
\item \begin{equation*}
\begin{prooftree}%[center=false]
\hypo{F(a),\Gamma\to\Delta}
\infer1[\(\exists\)left]{\exists xF(x),\Gamma\to\Delta}
\end{prooftree}\hspace{1cm}
\begin{prooftree}%[center=false]
\hypo{\Gamma\to\Delta,F(t)}
\infer1[\(\exists\)right]{\Gamma\to\Delta,\exists xF(x)}
\end{prooftree}
\end{equation*}
where \(a\) does not occur in the lower sequent, and \(t\) is an arbitrary
term

\(F(a)\) and \(Ft\) are called the auxiliary formulas and \(\exists xF(x)\) the
principal formula. The \(a\) in \(\exists\)left is called the
eigenvariable of this inference
\end{enumerate}


In \(\exists\)left \(a\) is fully indicated

5 and 6 are called the \textbf{quantifier inferences}. The condition, that the
eigenvariable must not occur in the lower sequent in \(\forall\)right and
\(\exists\)left is called the \textbf{eigenvariable condition}

A sequent of the form \(A\to A\) is called an \textbf{initial sequent} or axiom

\begin{definition}[]
A \textbf{proof} \(P\) (in \(\LK\)), or \textbf{\(\LK\)-proof}, is a tree of sequents
satisfying the following conditions
\begin{enumerate}
\item The topmost sequents of \(P\) are initial sequents
\item Every sequent in \(P\) except the lowest one is an upper sequent of an
inference whose lower sequent is also in \(P\)
\end{enumerate}
\end{definition}

\begin{definition}[]
\begin{enumerate}
\item A sequence of sequents in a proof \(P\) is called a \textbf{thread} (of \(P\)) if
the following conditions are satisfied
\begin{enumerate}
\item The sequence begins with an initial sequent and ends with the end-sequent
\item Every sequent in the sequence except the last is an upper sequent of an
inference, and is immediately followed by the lower sequent of this inference
\end{enumerate}
\item Let \(S_1,S_2\)and \(S_3\) be sequents in a proof \(P\). We say \(S_1\)
is \textbf{above} \(S_2\)or \(S_2\) is \textbf{below} \(S_1\) if there is a thread
containing both \(S_1\)and \(S_2\) where \(S_1\) appears before
\(S_2\). If \(S_1\)is above \(S_2\)and \(S_2\) is above \(S_3\), we say
\(S_2\) is \textbf{between} \(S_1\) and \(S_3\)
\item An inference in \(P\) is said to be \textbf{below a sequent} \(S\) if its lower
sequent is below \(S\)
\item Let \(P\) be a proof. A part of \(P\) which itself is a proof is called a
\textbf{subproof} of \(P\). For any sequent \(S\) in \(P\), that part of \(P\)
which consists of all sequents which are either \(S\)itself or which occur
above \(S\)is called a subproof of \(P\) (with end-sequent \(S\))
\item Let \(P_0\) be a proof of the form
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{}{\Gamma\to\Theta}
\ellipsis{(*)}{}
\end{prooftree}
\end{equation*}
where (*) denotes the part of \(P_0\) under \(\Gamma\to\Theta\), and let
\(Q\) be a proof ending with \(\Gamma,D\to\Theta\). By a copy of \(P_0\) from
\(Q\) we mean a proof \(P\) of the form
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{Q}{\Gamma,D\to\Theta}
\ellipsis{(**)}{}
\end{prooftree}
\end{equation*}
where \((**)\) differs from \((*)\) only in that for each sequent in \((*)\),
say \(\Gamma\to\Lambda\), the corresponding sequent in \((**)\) has the
form \(\Pi,D\to\Lambda\).
\item Let \(S(a)\) or \(\Gamma(a)\to\Delta(a)\), denote a sequent of the form
\(A_1(a),\dots,A_m(a)\to B_1(a),\dots,B_n(a)\). Then \(S(t)\), or
\(\Gamma(t)\to\Delta(t)\), denotes the sequent
\end{enumerate}
\(A_1(t),\dots,A_m(t)\to B_1(t),\dots,B_n(t)\)
\end{definition}

\begin{definition}[]
A proof in \(\LK\) is called \textbf{regular} if it satisfies the condition that all
eigenvariables are distinct from one another and if a free variable \(a\)
occurs as an eigenvariable in a sequent \(S\) of the proof, then \(a\) occurs
only in sequents above \(S\)
\end{definition}

\begin{lemma}[]
\begin{enumerate}
\item Let \(\Gamma(a)\to\Delta(a)\) be an (\(\LK\)-)provable sequent in which \(a\)
is fully indicated, and let \(P(a)\) be a proof of \(\Gamma(a)\to\Delta(a)\).
Let \(b\) be a free variable not occurring in \(P(a)\). Then the tree
\(P(b)\), obtained from \(P(a)\) by replacing \(a\) by \(b\) at each
occurrence of \(a\) in \(P(a)\), is also a proof and its end-sequent is \(\Gamma(b)\to\Delta(b)\)
\item For an arbitrary \(\LK\)-proof there exists a regular proof of the same
end-sequent. Moreover, the required proof is obtained from the original
proof simply by replacing free variables
\end{enumerate}
\end{lemma}

\begin{proof}
\begin{enumerate}
\item By induction on the number of inference in \(P(a)\). If \(P(a)\) consists
of simply an initial sequent \(A(a)\to A(a)\), then \(P(b)\) consists of the
sequent \(A(b)\to A(b)\).

Suppose that our proposition holds for proofs containing at most \(n\)
inferences and suppose that \(P(a)\) contains \(n+1\) inferences. We treat
the possible cases according to the last inferences in \(P(a)\). Since
other cases can be treated similarly, we consider only the case where the
last inference, say \(J\), is a \(\forall\)right. Suppose the
eigenvariable of \(J\) is \(a\), and \(P(a)\) is of the form
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{\(Q(a)\)}{\Gamma\to\Lambda,A(a)}
\infer1[\(J\)]{\Gamma\to\Lambda,\forall xA(x)}
\end{prooftree}
\end{equation*}
where \(Q(a)\) is the subproof of \(P(a)\) ending with
\(\Gamma\to\Lambda,A(a)\). \(a\) doesnt occur in \(\Gamma\), \(\Lambda\) or \(A(x)\). By the
induction hypotheses the result of replacing all \(a\)'s  in \(Q(a)\) by
\(b\) is a proof whose end-sequent is \(\Gamma\to\Lambda,A(b)\). \(\Gamma\) and \(\Lambda\)
contain no \(b\)'s. Thus we can apply a \(\forall\)right to this sequent
using \(b\) as its eigenvariable
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{\(Q(b)\)}{\Gamma\to\Lambda,A(b)}
\infer1[]{\Gamma\to\Lambda,\forall xA(x)}
\end{prooftree}
\end{equation*}
and so \(P(b)\) is a proof ending with \(\Gamma\to\Lambda,\forall xA(x)\). If
\(a\) is not the eigenvariable of \(J\), \(P(a)\) is of the form
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{\(Q(a)\)}{\Gamma(a)\to\Lambda(a),A(a,c)}
\infer1{\Gamma(a)\to\Lambda(a),\forall xA(a,x)}
\end{prooftree}
\end{equation*}
By the induction hypothesis the result of replacing all \(a\)'s in
\(Q(a)\) by \(b\)is a proof and its end-sequent is
\(\Gamma(b)\to\Lambda(b),A(b,c)\)

Since by assumption \(b\) doesn't occur in \(P(a)\), \(b\) is not \(c\)
and so we can apply a \(\forall\)right to this sequent, with \(c\) as its eigenvariable

\item By mathematical induction on the number \(l\) of applications of
\(\forall\)right and \(\exists\)left in a given proof \(P\). If \(l=0\)
then take \(P\) itself. Otherwise, \(P\) can be represented in the form
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{P_1\quad P_2\dots P_k}
\ellipsis{(*)}{S}
\end{prooftree}
\end{equation*}
where \(P_i\) is a subproof of \(P\) of the form
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{}{\Gamma_i\to\Delta_i,F_i(b_i)}
\infer1[\(I_i\)]{\Gamma_i\to\Delta_i,\forall y_iF_i(y_i)}
\end{prooftree}
\quad\text{ or }\quad
\begin{prooftree}%[center=false]
\hypo{}
\ellipsis{}{F_i(b_i),\Gamma_i\to\Delta_i}
\infer1[\(I_i\)]{\exists y_iF_i(y_i),\Gamma_i\to\Delta_i}
\end{prooftree}      
\end{equation*}
and \(I_i\) is a lowermost \(\forall\)right or \(\exists\)left in \(P\)

Let us deal with the case where \(I_i\) is \(\forall\)right. \(P_i\) has
fewer applications of \(\forall\)right or \(\exists\)left than \(P\), so
by the induction hypothesis there is a regular proof \(P_i'\) of
\(\Gamma_i\to\Delta_i,F_i(b_i)\). Note that no free variable in
\(\Gamma_i\to\Delta_i,F_i(b_i)\) (including \(b_i\)) is used as an
eigenvariable in \(P_i'\). Suppose \(c_1,\dots,c_m\) are all the
eigenvariables in all the \(P_i\)'s which occur in \(P\) above
\(\Gamma_i\to\Delta_i,\forall y_iF_i(y_i), i=1,\dots,k\). Then change
\(c_1,\dots,c_m\) to \(d_1,\dots,d_m\) respectively, where
\(d_1,\dots,d_m\) are the first \(m\) variables which occur neither in
\(P\) nor in \(P_i\)'. If \(b_i\) occurs in \(P\) below
\(\Gamma_i\to\Delta_i,\forall y_iF_i(y_i)\) then change it to \(d_{m+i}\)

Let \(P_i''\) be the proof which is obtained from \(P_i'\) by the above
replacement of varaibles. Then \(P_1'',\dots,P_k''\) are each regular
\begin{equation*}
\begin{prooftree}%[center=false]
\hypo{P_1''\dots
\begin{prooftree}%[center=false]
\hypo{P_i''}
\infer1{\Gamma_i\to\Delta_i,\forall y_iF_i(y_i)}
\end{prooftree}\dots P_n''}
\ellipsis{(*)}{S}
\end{prooftree}
\end{equation*}
\end{enumerate}
\end{proof}

From now on we will assume that we are dealing with regular proofs whenever
convenient

\begin{lemma}[]
Let \(t\) be an arbitrary term. Let \(\Gamma(a)\to \Delta(a)\) be a provable (in \(\LK\))
sequent in which \(a\) is fully indicated, and let \(P(a)\) be a proof ending
with \(\Gamma(a)\to \Delta(a)\) in which \textbf{every eigenvariable is different from \(a\) and
not contained in \(t\)}. Then \(P(t)\) is a proof whose end-sequent is
\(\Gamma(t)\to \Delta(t)\)
\end{lemma}

\begin{lemma}[]
Let \(t\) be an arbitrary term. Let \(\Gamma(a)\to \Delta(a)\) be a provable (in \(\LK\))
sequent in which \(a\) is fully indicated, and let \(P(a)\) be a proof of
\(\Gamma(a)\to \Delta(a)\). Let \(P'(a)\) be a proof obtained from \(P(a)\) by changing
eigenvariables in such a way that in \(P'(a)\) every eigenvariable is
different from \(a\) and not contained in \(t\). Then \(P'(t)\) is a proof of
\(\Gamma(t)\to \Delta(t)\)
\end{lemma}

\begin{proposition}[]
Let \(t\) be an arbitrary term and \(S(a)\) a provable sequent in which \(a\)
is fully indicated. Then \(S(t)\) is also provable
\end{proposition}

\begin{proposition}[]
\label{prop2.14}
If a sequent is provable, then it is provable with a proof in which all the
initial sequents consist of atmoic formulas. Furthermore, if a sequent is
provable without cut, then it is provable without cut with a proof of the
above sort
\end{proposition}

\begin{proof}
It suffices to show that for an arbitrary formula \(A\), \(A\to A\) is
provable without cut, starting with initial sequents consisting of atomic formulas.
\end{proof}

\begin{definition}[]
Two formulas \(A\) and \(B\) are \textbf{alphabetical variants} if for some
\(x_1,\dots,x_n,y_1,\dots,y_n\)
\begin{equation*}
\left(A\frac{x_1,\dots,x_n}{z_1,\dots,z_n}
\right)
\end{equation*}
is
\begin{equation*}
\left(
B\frac{y_1,\dots,y_n}{z_1,\dots,z_n}
\right)
\end{equation*}
where \(z_1,\dots,z_n\) are bound variables occurring neither in \(A\) nor in
\(B\). The fact that \(A\) and \(B\) are alphabetical variants will be
expressed by \(A\sim B\)
\end{definition}
