books/Prooftheory.org
** A formulation of intuitionistic predicate calculus
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   We can formalize the intuitionistic predicate calculus as a subsystem of
   \(\LK\) which we call \(\LJ\) following Gentzen (\(\bJ\) stands for
   "intuitionistic"). \(\LJ\)is obtained from \(\LK\) by modifying it as follows
   1. A sequent in \(\LJ\) is of the form \(\Gamma \to \Delta \) where \Delta consists of at most
      one formula
   2. Inferences in \(\LJ\) are those obtained from those in \(\LK\) by imposing
      the restriction that the succedent of each upper and lower sequent
      consists of at most one formula; thus there are no inferences in
      \(\LJ\)corresponding to contraction right or exchange right
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_proposition
   If a sequent \(S\) of \(\LJ\) is provable in \(\LJ\), then it is also
   provable in \(\LK\)
   #+END_proposition

** Axiom systems
   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   The basic system is \(\LK\)
   1. A finite or infinite set \(\cala\) of sentences is called an *axiom system*,
      and each of these sentences is called an *axiom* of \(\cala\). Sometimes an
      axiom system is called a *theory*
   2. A finite (possibly empty) sequence of formulas consisting only of axioms
      of \(\cala\) is called an *axiom sequence* of \(\cala\)
   3. If there exists an axiom sequence \(\Gamma_0\) of \(\cala\) s.t.
      \(\Gamma_0,\Gamma\to\Delta\) is \(\LK\)-provable, then \(\Gamma \to \Delta\) is
      said to be *provable from* \(\cala\) (in \(\LK\)). We express this by \(\cala,\Gamma\to\Delta\)
   4. \(\cala\) is *inconsistent* (with \(\LK\)) if the empty sequent \(\to\) is
      provable from \(\cala\) (in \(\LK\))
   5. If all function constants and predicate constants in a formula \(A\) occur
      in \(\cala\), then \(A\) is said to be *dependent on* \(\cala\)
   6. A sentence \(A\) is *consistent* if the axiom system \(\{A\}\) is consistent
   7. \(\LK_{\cala}\) is the system obtained from \(\LK\) by adding \(\to A\) as
      initial sequents for all \(A\) in \(\cala\)
   #+END_definition

   #+ATTR_LATEX: :options []
   #+BEGIN_proposition
   Let \(\cala\) be an axiom system. Then the following are equivalent
   1. \(\cala\) is inconsistent (with \(\LK\))
   2. for every formula \(A\), \(A\) is provable from \(\cala\)
   3. for some formula \(A\), \(A\)and \(\neg A\) are both provable from \(\cala\)
   #+END_proposition

   #+BEGIN_proof
   \(1\leftrightarrow 2\), \(2\leftrightarrow3\). \(\to A\vee B\) and
   \(\to \neg A\vee B\) implies \(\to B\)
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_proposition
   Let \(\cala\) be an axiom system. Then a sequent \(\Gamma\to \Delta\) is
   \(\LK_{\cala}\)-provable iff \(\Gamma\to\Delta\) is provable from \(\cala\)
   (in \(\LK\))
   #+END_proposition

   #+ATTR_LATEX: :options []
   #+BEGIN_corollary
   An axiom system \(\cala\) is consistent (with \(\LK\)) iff \(\LK_{\cala}\) is consistent
   #+END_corollary

   These definitions and the propositions hold also for \(\LJ\)

