latex/ProofTheory/ProofTheory.tex

\subsection{A formulation of intuitionistic predicate calculus}
\label{sec:orge507601}
\begin{definition}[]
We can formalize the intuitionistic predicate calculus as a subsystem of
\(\LK\) which we call \(\LJ\) following Gentzen (\(\bJ\) stands for
"intuitionistic"). \(\LJ\)is obtained from \(\LK\) by modifying it as follows
\begin{enumerate}
\item A sequent in \(\LJ\) is of the form \(\Gamma \to \Delta\) where \(\Delta\) consists of at most
one formula
\item Inferences in \(\LJ\) are those obtained from those in \(\LK\) by imposing
the restriction that the succedent of each upper and lower sequent
consists of at most one formula; thus there are no inferences in
\(\LJ\)corresponding to contraction right or exchange right
\end{enumerate}
\end{definition}

\begin{proposition}[]
If a sequent \(S\) of \(\LJ\) is provable in \(\LJ\), then it is also
provable in \(\LK\)
\end{proposition}

\subsection{Axiom systems}
\label{sec:org9b3d5e0}
\begin{definition}[]
The basic system is \(\LK\)
\begin{enumerate}
\item A finite or infinite set \(\cala\) of sentences is called an \textbf{axiom system},
and each of these sentences is called an \textbf{axiom} of \(\cala\). Sometimes an
axiom system is called a \textbf{theory}
\item A finite (possibly empty) sequence of formulas consisting only of axioms
of \(\cala\) is called an \textbf{axiom sequence} of \(\cala\)
\item If there exists an axiom sequence \(\Gamma_0\) of \(\cala\) s.t.
\(\Gamma_0,\Gamma\to\Delta\) is \(\LK\)-provable, then \(\Gamma \to \Delta\) is
said to be \textbf{provable from} \(\cala\) (in \(\LK\)). We express this by \(\cala,\Gamma\to\Delta\)
\item \(\cala\) is \textbf{inconsistent} (with \(\LK\)) if the empty sequent \(\to\) is
provable from \(\cala\) (in \(\LK\))
\item If all function constants and predicate constants in a formula \(A\) occur
in \(\cala\), then \(A\) is said to be \textbf{dependent on} \(\cala\)
\item A sentence \(A\) is \textbf{consistent} if the axiom system \(\{A\}\) is consistent
\item \(\LK_{\cala}\) is the system obtained from \(\LK\) by adding \(\to A\) as
initial sequents for all \(A\) in \(\cala\)
\end{enumerate}
\end{definition}

\begin{proposition}[]
Let \(\cala\) be an axiom system. Then the following are equivalent
\begin{enumerate}
\item \(\cala\) is inconsistent (with \(\LK\))
\item for every formula \(A\), \(A\) is provable from \(\cala\)
\item for some formula \(A\), \(A\)and \(\neg A\) are both provable from \(\cala\)
\end{enumerate}
\end{proposition}

\begin{proof}
\(1\leftrightarrow 2\), \(2\leftrightarrow3\). \(\to A\vee B\) and
\(\to \neg A\vee B\) implies \(\to B\)
\end{proof}

\begin{proposition}[]
Let \(\cala\) be an axiom system. Then a sequent \(\Gamma\to \Delta\) is
\(\LK_{\cala}\)-provable iff \(\Gamma\to\Delta\) is provable from \(\cala\)
(in \(\LK\))
\end{proposition}

\begin{corollary}[]
An axiom system \(\cala\) is consistent (with \(\LK\)) iff \(\LK_{\cala}\) is consistent
\end{corollary}

These definitions and the propositions hold also for \(\LJ\)
