books/Prooftheory.org
** The cut-elimination theroem
   #+ATTR_LATEX: :options [the cut-elimination theroem: Gentzen]
   #+BEGIN_theorem
   If a sequent is \((\LK)\)-provable, then it is \((\LK)\)-provable without a cut
   #+END_theorem

   Let \(A\)be a formula. An inference of the following form is called a *mix*
   (w.r.t. \(A\)):
   \begin{equation*}
   \begin{prooftree}%[center=false]
   \hypo{\Gamma\to\Delta}
   \hypo{\Pi\to\Lambda}
   \infer2[\(A\)]{\Gamma,\Pi^* \to \Delta^*, \Lambda}
   \end{prooftree}
   \end{equation*}
   where both \Delta and \Pi contain the formula \(A\), and \(\Delta^*\) and \(\Pi^*\) are
   obtained from \Delta and \Pi respectively by deleting all the occurrences of \(A\)
   in them. We call \(A\) the mix formula of this inference.

   Let's call the system which is obtained from \(\LK\) by replacing the cut
   rule by the mix rule, \(\LKs\).

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   \(\LK\) and \(\LKs\) are equivalent, that is, a sequent \(S\) is
   \(\LK\)-provable iff \(S\) is \(\LKs\)-provable
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   If a sequent is provable in \(\LKs\), then it's provable in \(\LKs\) without
   a mix
   #+END_theorem

   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   If \(P\) is a proof of \(S\) (in \(\LKs\)) which contains (only) one mix,
   occurring as the last inference, then \(S\) is provable without a mix
   #+END_lemma

   The *grade* of a formula \(A\) (denoted by \(g(A)\)) is the number of logical
   symbols contained in \(A\). The grade of a mix is the grade of the mix
   formula. When a proof \(P\) has a mix as the last inference, we define the
   grade of \(P\) (denoted by \(g(P)\)) to be the grade of this mix.

   Let \(P\) be a proof which contains  a mix only as the last inference
   \begin{equation*}
   J\;\begin{prooftree}%[center=false]
   \hypo{\Gamma\to\Delta}
   \hypo{\Pi \to \Lambda}
   \infer2[\((A)\)]{\Gamma,\Pi^* \to \Delta^*,\Lambda}
   \end{prooftree}
   \end{equation*}
   We refer to the left and right upper sequents as \(S_1\) and \(S_2\) and to
   the lower sequent as \(S\). We call a thread in \(P\) a *left (right) thread*
   if it contains the left (right) upper sequent of the mix \(J\). The *rank* of a
   thread \(\calf\) in \(P\) is defined as follows: if \(\calf\) is a left
   (right) thread, then the rank of \(\calf\) is the number consecutive
   sequents, counting upward from the left (right) upper sequent of \(J\), that
   contains the mix formula in its succedent (antecedent). The rank of a thread
   \(\calf\) in \(P\) is denoted by \(\rank(\calf;P)\). We define
   \begin{equation*}
   \rank_l(P)=\max_{\calf}(\rank(\calf;P))
   \end{equation*}
   where \(\calf\) ranges over all the left threads in \(P\), and
   \begin{equation*}
   \rank_r(P)=\max_{\calf}(\rank(\calf;P))
   \end{equation*}
   where \(\calf\) ranges over all the right threads in \(P\). The rank of
   \(P\), \(\rank(P)\), is defined as
   \begin{equation*}
   \rank(P)=\rank_l(P)+\rank_r(P)
   \end{equation*}
   Note that \(\rank(P)\ge 2\)
   
   #+BEGIN_proof
   We prove the Lemma by double induction on the grade \(g\) and rank \(r\) of
   the proof \(P\) (i.e. transfinite induction on \(\omega\cdot g+r\)). We
   divide the proof into two main cases, namely \(r=2\) and \(r>2\)

   1. \(r=2\), \(\rank_l(P)=\rank_r(P)=1\)
      1. The left upper sequent \(S_1\) is an initial sequent. In this case we
         may assume \(P\) is of the form
         \begin{equation*}
         J\;\begin{prooftree}%[center=false]
         \hypo{A\to A}
         \hypo{\Pi\to \Lambda}
         \infer2{A,\Pi^*\to\Lambda}
         \end{prooftree}
         \end{equation*}
         We can obtain the lower sequent without a mix
         \begin{equation*}
         \begin{prooftree}%[center=false]
         \hypo{\Pi\to\Lambda}
         \infer1{\text{some exchanges}}
         \infer1{A,\dots,A,\Pi^*\to\Lambda}
         \infer1{\text{some contractions}}
         \infer1{A,\Pi^*\to\Lambda}
         \end{prooftree}
         \end{equation*}
      2. The right upper sequent \(S_2\) is an initial sequent.
      3. Neither \(S_1\) nor \(S_2\) is an initial sequent, and \(S_1\) is the
         lower sequent of a structural inference \(J_1\). Since
         \(\rank_l(P)=1\), the formula \(A\) cannot appear in the succedent of
         the upper sequent of \(J_1\). Hence
         \begin{equation*}
         \begin{prooftree}%[center=false]
         \hypo{\Gamma\to\Delta_1}
         \infer1[\(J_1\)]{\Gamma\to\Delta_1,A}
         \hypo{\Pi\to\Lambda}
         \infer2[\(J\)]{\Gamma,\Pi^*\to\Delta_1,\Lambda}
         \end{prooftree}
         \end{equation*}
         where \(\Delta_1\) doesn't contain \(A\). We can eliminate the mix as
         follows
         \begin{equation*}
         \begin{prooftree}%[center=false]
         \hypo{\Gamma\to\Delta_1}
         \infer1{\text{some weakenings}}
         \infer1{\Pi^*,\Gamma\to\Delta_1,\Lambda}
         \infer1{\text{some exchanges}}
         \infer1{\Gamma,\Pi^*\to\Delta_1,\Lambda}
         \end{prooftree}
         \end{equation*}
      4. None of 1.1-1.3 holds but \(S_2\) is the lower sequent of a structural
         inference. Similarly
      5. Both \(S_1\)and \(S_2\)are the lower sequents of logical inferences. In
         this case, since \(\rank_l(P)=\rank_r(P)=1\), the mix formula on each
         side must be the principal formula of the logical inference. We use
         induction on the grade, distinguishing several cases according to the
         outermost logical symbol of \(A\)
         1. The outermost logical symbol of \(A\) is \(\wedge\)
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma\to\Delta_1,B}
            \hypo{\Gamma\to\Delta_1,C}
            \infer2{\Gamma\to\Delta_1,B\wedge C}
            \hypo{B,\Pi_1\to\Lambda}
            \infer1{B\wedge C,\Pi_1\to \Lambda}
            \infer2[(\(B\wedge C\))]{\Gamma,\Pi_1\to\Delta_1,\Lambda}
            \end{prooftree}
            \end{equation*}
            where by assumption none of the proofs ending with
            \(\Gamma\to\Delta_1,B\);\(\Gamma\to\Delta_1,C\) or
            \(B,\Pi_1\to\Lambda\) contain a mix. Consider the following
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma\to\Delta_1,B}
            \hypo{B,\Pi_1\to\Lambda}
            \infer2[\((B)\)]{\Gamma,\Pi_1''\to\Delta_1'',\Lambda}
            \end{prooftree}
            \end{equation*}
            This proof contains only one mix, a mix that occurs as its last
            inference. Furthermore the grade of the mix formula \(B\) is less
            than \(g(A)\). So by induction hypothesis we can obtain a proof
            which contains no mixes and whose end-sequent is
            \(\Gamma,\Pi_1''\to\Delta_1'',\Lambda\). From this we can obtain a proof
            without a mix with end-sequent \(\Gamma,\Pi_1\to\Delta_1,\Lambda\)
         2. The outermost logical symbol of \(A\) is \(\forall\)
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma\to\Delta_1,F(a)}
            \infer1{\Gamma\to\Delta_1,\forall xF(x)}
            \hypo{F(t),\Pi_1\to\Lambda}
            \infer1{\forall xF(x),\Pi_1\to\Lambda}
            \infer2{\Gamma,\Pi_1\to\Delta_1,\Lambda}
            \end{prooftree}
            \end{equation*}
            (\(a\) being fully indicated in \(F(a)\)). By the eigenvariable
            condition, \(a\) does not occur in \(\Gamma,\Delta_1\) or \(F(x)\). Since
            by assumption the proof ending with \(\Gamma\to\Delta_1, F(a)\)
            contains no mix, we can obtain a proof without a mix, ending with
            \(\Gamma\to\Delta_1,F(t)\). Consider now
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma\to\Delta_1,F(t)}
            \hypo{F(t),\Pi_1\to\Lambda}
            \infer2[\((F(t))\)]{\Gamma,\Pi_1'''\to\Delta_1''',\Lambda}
            \end{prooftree}
            \end{equation*}
   2. \(r>2\), i.e., \(\rank_l(P)>1\) and/or \(\rank_r(P)>1\)

      The induction hypothesis is that every proof \(Q\) which contains a mix
      only as the last inference, and which satisfies either \(g(Q)<g(P)\), or
      \(g(Q)=g(P)\) and \(\rank(Q)<\rank(P)\), we can eliminate the mix
      1. \(\rank_r(P)>1\)
         1. \Gamma or \Delta (in \(S_1\)) contains \(A\). Construct a proof as follows
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{}
            \ellipsis{}{\Pi\to\Lambda}
            \infer1{\text{exchanges/contractions}}
            \infer1{A,\Pi^*\to\Lambda}
            \infer1{\text{weakenings/exchanges}}
            \infer1{\Gamma,\Pi^*\to\Delta^*,\Lambda}
            \end{prooftree}\quad
            \begin{prooftree}%[center=false]
            \hypo{}
            \ellipsis{}{\Gamma\to\Delta}
            \infer1{\text{exchanges/contractions}}
            \infer1{\Gamma\to\Delta^*,A}
            \infer1{\text{weakenings/exchanges}}
            \infer1{\Gamma,\Pi^*\to\Delta^*,\Lambda}
            \end{prooftree}
            \end{equation*}

         2. \(S_2\) is the lower sequent of an inference \(J_2\), where \(J_2\)
            is not a logical inference whose principal formula is \(A\). The
            last part of \(P\) looks like this
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma\to\Delta}
            \hypo{\Phi\to\Psi}
            \infer1[\(J_2\)]{\Pi\to\Lambda}
            \infer2{\Gamma,\Pi^*\to\Delta^*,\Lambda}
            \end{prooftree}
            \end{equation*}
            where the proofs \(\Gamma\to\Delta\) and \(\Phi\to\Psi\) contain no
            mixes and \Phi contains at least one \(A\). Consider the following
            proof \(P'\):
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma\to\Delta}
            \hypo{\Phi\to\Psi}
            \infer2[(\(A\))]{\Gamma,\Phi^*\to\Delta^*,\Psi}
            \end{prooftree}
            \end{equation*}
            In \(P'\), the grade of the mix is equal to \(g(P)\),
            \(\rank_l(P')=\rank_l(P)\) and \(\rank_r(P')=\rank_r(P)-1\). Thus by
            induction hypothesis, \(\Gamma,\Phi^*\to\Delta^*,\Psi\) is provable without
            a mix. Then we construct the proof
            \begin{equation*}
            \begin{prooftree}%[center=false]
            \hypo{\Gamma,\Phi^*\to\Delta^*,\Psi}
            \infer1{\text{some exchanges}}
            \infer1{\Phi^*,\Gamma\to\Delta^*,\Psi}
            \infer1[\(J_2\)]{\Pi^*,\Gamma\to\Delta^*,\Lambda}
            \end{prooftree}
            \end{equation*}

         3. \Gamma contains no \(A\)'s and \(S_2\) is the lower sequent of a logical
            inference whose principal formula is \(A\).
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   The cut-elimination theorem holds for \(\LJ\)
   #+END_theorem

