books/Prooftheory.org
** TODO ALL the problems
   [[Problem1]]
   
   A example of preview
   \begin{equation*}
   \begin{prooftree}%[center=false]
   \hypo{hypo1}
   \hypo{hypo2}
   \infer2[\(wef\)]{meow}
   \end{prooftree}
   \end{equation*}

   then for the same latex code
   \begin{equation*}
   \begin{prooftree}%[center=false]
   \hypo{hypo1}
   \hypo{hypo2}
   \infer2[\(wef\)]{meow}
   \end{prooftree}
   \end{equation*}

   we have immediate preiview:)
